[
    {
        "id": "1",
        "image": "1.png",
        "title": "এপিআই(API) কি?",
        "subtitle": "এপিআই(API) এর পরিচিতি এবং প্রয়োজনীয়তা",
        "category": "তথ্য ও প্রযুক্তি",
        "publish_date": "২০২৪-০৩-২১",
        "author": "সামির ইসলাম",
        "content": "এপিআই(API) বা Application Program Interface হচ্ছে সফটওয়্যার তৈরির জন্য রুটিনস, প্রোটকলস এবং বিভিন্ন টুলসের সমণ্বয় করা । অন্যভাবে বলা যায় , একটি প্রোগ্রামের সাথে অন্য একটি প্রোগ্রামের সমণ্বয় বা ডাটা আদান-প্রদান করা ।\n\nএপিআই(API) এর প্রয়োজনীয়তা :\n\nধরুন আপনি একটা অ্যাপস তৈরি করলেন কিন্তু সেটা শুধুমাত্র একটি ডিভাইসে সাপোর্ট করে , তাহলে সেটি বেশি ইউজফুল হবে না । যদি আপনি আপসটি মাল্টিপল ডিভাইস বা আপারেটিং সিস্টেমের জন্য উপযোগী হয় তবেই সেটি অধিক ইউজফুল হবে ।\n\nজনপ্রিয় এপিআই(API) সমূহ :\n\n১) গুগল ম্যাপস এপিআই(API)\n\n২)ইউটিউব এপিআই(API)\n\n৩)ফেজবুক এপিআই(API)\n\n৪) অ্যামাজন এড এপিআই(API)\n\nউদাহরণ ও প্রয়োগ :\n\n১) মনে করুন, আপনি একটি ওয়েবসাইট তৈরি করেছেন যেটি শুধুমাত্র কম্পিউটার দিয়েই ব্রাউজ করা যায় । কিন্তু বর্তমান সময়ে মানুষ আর শুধু কম্পিউটারের উপর নির্ভরশীল নয় । এমনকি সম্প্রতি জরিপে দেখা যাচ্ছে , বেশিরভাগ মানুষই এখন এন্ড্রয়েড, আইফোন, ট্যাবলেট এবং স্মার্ট ডিভাইসগুলোর উপরই বেশী নির্ভরশীল । ফলে যদি আপনার ওয়েবসাইটি এপিআই(API) ভিত্তিক হয়, তবে সেটা সব প্লাটফর্মের জন্যেই ওপেন থাকছে ।\n\n২) কোন একটি কোম্পানি একটি প্রিন্টার তৈরি করল, কিন্তু কোন টেক্স এডিটর তৈরি করল না ।তাহলে কিভাবে সেটি কাজ করবে ? যদি তৈরি করেও তবে কয়টি অ্যপ্লিকেশনের জন্য তৈরি করবে ? বাস্তবে হাজার হাজার এপ্লিকেশন থেকেই প্রিন্ট করা যায় । এক্ষেত্রে এপ্লিকেশন এবং প্রিন্টারের কোন সম্পর্ক নেই । এখানে প্রিন্টার এবং এপ্লিকেশন একটি ইন্টারফেস বা এপিআই(API) বা এপিআই(API) ব্যবহার করে যোগাযোগ করে থাকে ।\n\n৩) কেউ যদি একটা অ্যাপস তৈরি করল যেটি ইউন্ডোজ, লিনাক্স ইত্যাদি অপারেটিং সিস্টেমে চলে । এখন এটাকে যদি আপডেট ভার্সন বা অন্যকোন অপারেটিং সিস্টেমে চলতে হয় তবে ফ্রন্টএন্ড এপিআই(API) এর সাথে জুড়ে দিলেই হবে । মুল কাজ একই থাকবে শুধুমাত্র বিভিন্ন প্লাটফর্মে কাজের উপোগী হবে ।"
    },
    {
        "id": "2",
        "image": "2.jpg",
        "title": "ডেভিন: বিশ্বের প্রথম এআই সফটওয়্যার ইঞ্জিনিয়ার",
        "subtitle": "টেক সংস্থা কগনিশন তার পাশে",
        "category": "তথ্য ও প্রযুক্তি",
        "publish_date": "২০২৪-০৩-২২",
        "author": "ফারহানা খান",
        "content": "দুনিয়াজুড়ে আলোড়ন ফেলেছে ডেভিন। বিশ্বের প্রথম এআই সফটওয়্যার ইঞ্জিনিয়ারকে সামনে এনেছে টেক সংস্থা কগনিশন। চোখের পলকে মোবাইল অ্যাপ ডেভেলপ থেকে গোটা ওয়েবসাইট তৈরি করতে পারে এই রোবট। এখন ডেভিন আসার ফলে কাজ হারানোর আশঙ্কা মানুষের মধ্যে আরও বেড়েছে।\n\nডেভিনের দক্ষতায় হতবাক গোটা বিশ্ব। কিছু দিন আগে মনে করা হচ্ছিল যে কৃত্রিম বুদ্ধিমত্তার (AI) কারণে মানুষজন তাদের কাজ হারাতে পারেন। যেভাবে বাড়ছে কৃত্রিম বুদ্ধিমত্তার দাপট তাতে মন হচ্ছে AI মানুষের জায়গা নিয়ে নিয়েছে । সাম্প্রতিক কালে এআই শিক্ষক থেকে এআই মডেল সব কিছুই সামনে এসেছে। এবার সামনে এল বিশ্বের প্রথম এআই সফ্টওয়্যার ইঞ্জিনিয়ারও ।\n\nহ্যাঁ, আমরা ডেভিনের কথা বলছি যিনি একজন এআই সফ্টওয়্যার ইঞ্জিনিয়ার এবং মিনিটে অ্যাপ তৈরি থেকে ভিডিও এডিটিং সবটাই তার নখদর্পনে। ডেভিন সফটওয়্যার ইঞ্জিনিয়ারিং ক্ষেত্রে বিশেষ ভাবে প্রশিক্ষিত।\n\nআসুন জেনে নেওয়া যাক ডেভিনের বিষয়ে আরও খুঁটিনাটি\n\nDevin Cognition Labs নামে একটি AI স্টার্টআপ তৈরি করেছে। সংস্থা দাবি করেছে ওয়েবসাইট তৈরি থেকে অ্যাপ তৈরি এমনকি নিজেই একটি এআই টুল তৈরি করতে পারে এই ডেভিন । এছাড়াও এটি যেকোন AI টুলকে প্রশিক্ষণও দিতে পারে। এই এআই ইঞ্জিনিয়ার সফটওয়্যার সংক্রান্ত যেকোন জটিল কাজ করতে পারে বলেই দাবি। সফ্টওয়্যার বা প্রোগ্রামিং সংক্রান্ত যে কোন ভূল মুহূর্তেই ধরিয়ে দিতে পারে ডেভিন।\n\nআরও দাবি করা হয়েছে ডেভিন এন্ড টু এন্ড এনক্রিপশন সহ যে কোন অ্যাপ ডিজাইন করতে পারে। এটি ছাড়াও, এটি স্বয়ংক্রিয়ভাবে ত্রুটি সংশোধন করতে পারে। তবে এটি এখনও সাধারণ মানুষের জন্য উপলব্ধ হয়নি।"
    },
    {
        "id": "3",
        "image": "3.jpg",
        "title": "তাদের ই-সিম সার্ভিস: টেলিটকের নতুন উদ্যোগ",
        "subtitle": "বাংলাদেশে ই-সিম পরিচালনা সম্পর্কে পরিচিতি",
        "category": "তথ্য ও প্রযুক্তি",
        "publish_date": "২০২৪-০২-2৩",
        "author": "নাসির আহমেদ",
        "content": "রাষ্ট্রায়ত্ত মোবাইল অপারেটর টেলিটক অবশেষে নিয়ে এলো তাদের ই-সিম সার্ভিস। ২১ ফেব্রুয়ারি আন্তর্জাতিক মাতৃভাষা দিবসে এই নতুন সেবা চালু করে টেলিটক। ই-সিম অধিক পরিবেশ-বান্ধব এবং অনলাইনের মাধ্যমে শুধুমাত্র সফটওয়্যার দ্বারা একটিভ করা যায়। বারবার সিম খুলে লাগানো, কিংবা সিম হারিয়ে ফেলার সমস্যাও ই-সিম এর সাথে নেই। এছাড়া একই সময়ে একাধিক ফোন নাম্বার ব্যবহার করা যাবে এই নতুন সিস্টেমে। মোবাইল এর মডেল এর উপর নির্ভর করে একই মোবাইলে একই সাথে ৫টি পর্যন্ত ইসিম ব্যবহার করা যাবে। ২০২২ সালের মার্চ মাসে সর্বপ্রথম দেশে ই-সিম সুবিধা চালু করে গ্রামীণফোন। এরপর রবি ও বাংলালিংকও সেবাটি চালু করে, সর্বশেষ টেলিটক এই সেবা চালু করেছে। ই-সিম বা এমবেডেড সিম মোটেও ট্রেডিশনাল সিম প্রযুক্তির মত নয়। ফিজিক্যাল সিম এর মত ই-সিম ম্যানুয়ালি ডিভাইসে প্রবেশ করাতে হয়না, এই ধরনের সিম ফোনেই বিল্ট-ইন থাকে। ব্যবহারকারীগণ খুব সহজে নেটওয়ার্কে লগিন করে সিম ব্যবহার করতে পারে এই প্রযুক্তিতে। আপনার বর্তমান টেলিটক সিমকে ই-সিমে রূপান্তর করার জন্য নিকটস্থ টেলিটক কাস্টমার কেয়ার সেন্টারে যোগাযোগ করুন।"
      },
      {
        "id": "4",
        "image": "4.jpg",
        "title": "মাইক্রোসফটের এআই নিয়ে বিস্তারিত",
        "subtitle": "এআই প্রযুক্তির উপকারিতা এবং কাজের ব্যবস্থাপনা",
        "category": "তথ্য ও প্রযুক্তি",
        "publish_date": "২০২৪-০৩-১৮",
        "author": "ফাহিম রহমান",
        "content": "মাইক্রোসফট বেশ কিছুদিন ধরেই এআই নিয়ে ব্যাপক কর্মযজ্ঞ চালাচ্ছে। সারাবিশ্বে তুমুল হইচই ফেলে দেওয়া চ্যাটজিপিটি নির্মাতা কোম্পানি ওপেনএআই’তে বিশাল পরিমাণ বিনিয়োগ করেছে মাইক্রোসফট। উইন্ডোজ ১১ এ ইতোমধ্যেই এআই নির্ভর অনেক ফিচার চলে এসেছে। যার মধ্যে রয়েছে এমএস পেইন্টে এইআই দ্বারা ইমেজ জেনারেট করার সুবিধা।\n\nআরও রয়েছে কোপাইলট নামের স্বাধীন একটি অ্যাপ। মাইক্রোসফট কোপাইলট অ্যাপ বর্তমানে উইন্ডোজ পিসি, এন্ড্রয়েড ডিভাইস এবং আইফোন ও আইপ্যাডের জন্য পাওয়া যাচ্ছে। কোপাইলট অ্যাপ ওপেন করে মাইক্রোসফটের এআই চ্যাটবটের সাথে মেসেজের মাধ্যমে চ্যাট করা যায়। এছাড়া ভয়েস দ্বারাও কোপাইলট’কে কমান্ড দেওয়া যায়।\n\nঅনেকটা মাইক্রোসফট বিং চ্যাটের মতই কাজ করে কোপাইলট। তবে এটা আরও বেশি অ্যাডভান্সড। সম্প্রতি মাইক্রোসফট তাদের উইন্ডোজ ব্লগে ঘোষণা করেছে তারা উইন্ডোজ কিবোর্ড লেআউটে কোপাইলট নামের নতুন একটি বাটন যোগ করবে।\n\nকম্পিউটারের কিবোর্ডে বর্ণমালা এবং সংখ্যা ছাড়াও বেশ কিছু অতিরিক্ত কী থাকে। যেমন কন্ট্রোল কী, অল্টার কী, প্রভৃতি। এছাড়া উইন্ডোজের স্টার্ট মেন্যুর জন্যও উইন্ডোজ পিসির কিবোর্ডে আলাদা একটি স্টার্ট বাটন থাকে।\n\nস্টার্ট বাটন প্রেস করলে উইন্ডোজের স্টার্ট মেন্যু আসে। এছাড়া মাউস দিয়েও স্টার্ট মেন্যু ক্লিক করে আনা যায়। তবে ডেডিকেটেড বাটন সব সময়ই দ্রুত কাজ করতে সহায়তা করে। মাইক্রোসফট যেহেতু এখন এআই নিয়ে অনেক বেশি আগ্রহী তাই তারা এবার এআই টুলের জন্য ডেডিকেটেড বাটন দিতে যাচ্ছে উইন্ডোজ পিসিতে।\n\nনতুন এই কী এর নাম হচ্ছে কোপাইলট। অর্থাৎ কোপাইলট কী প্রেস করলে পিসিতে কোপাইলট অ্যাপ চালু হবে। এরপর আপনি সেখানে বিভিন্ন প্রশ্ন করে উত্তর পেতে পারবেন এবং এআই দ্বারা বিভিন্ন কনটেন্ট তৈরি করতে পারবেন।\n\nমাইক্রোসফট বলছে, ২০২৪ হবে এআই পিসির বছর। তারা ভবিষ্যতে পিসি নির্মাতা কোম্পানিগুলোর জন্য লাইসেন্স নিতে কোপাইলট কী যুক্ত করাটা বাধ্যতামূলক করবে। এছাড়া নিজেদের তৈরি সার্ফেস ল্যাপটপেও নতুন এই বাটন প্রদান করবে। তবে কেউ যদি কোপাইলট প্রোগ্রাম বন্ধ রাখে তাহলে কোপাইলট বাটন চাপ দিলে উইন্ডোজ সার্স ওপেন হবে।"
      },
      {
        "id": "5",
        "image": "5.jpg",
        "title": "রিঅ্যাক্ট: জাভাস্ক্রিপ্টের স্বপ্নের লাইব্রেরী",
        "subtitle": "কেন রিঅ্যাক্ট ততটা জনপ্রিয় এবং তার বিশেষতা কি?",
        "category": "তথ্য ও প্রযুক্তি",
        "publish_date": "২০২৪-০৩-০৩",
        "author": "আবুল হাসান",
        "content": "রিঅ্যাক্ট! আমরা সবাই যারা জাভাস্ক্রিপ্ট এর সাথে পরিচিত আছি, সবাই মোটামোটি রিঅ্যাক্ট এর সাথে পরিচিত। অন্তত কখনো ট্রাই না করলেও এর নাম শুনেছেন, এটুকু শুনেছেন যে এটা অনেক হট একটা লাইব্রেরী। এটা শিখা অনেকের কাছে স্বপ্নের মতো। এর জন্যেই হয়তো অনেকের ইচ্ছা জাগে রিঅ্যাক্ট কিভাবে শিখা যায়। তো এটার নাম যেহেতু এতো মানুষের মুখে মুখে, তাহলে নিশ্চয়ই এটার মধ্যে কোন স্পেশালিটি আছে। আর হ্যাঁ অবশ্যই, রিঅ্যাক্ট এর মধ্যে বেশ অনেকগুলো স্পেশালিটি আছে, যার জন্যে এটা ডেভেলপার কমিউনিটিতে এতোটা পপুলারিটি পেয়েছে এবং এখন পর্যন্ত সগর্বে সব লাইব্রেরীর সাথে টেক্কা দিয়ে চলছে। এতো মানুষের মুখে মুখে শুনে রিঅ্যাক্ট স্পেশাল কিছু একটা ভাবলেও আজকে আমি এখানে বুঝিয়ে দিবো কেন আসলে রিঅ্যাক্ট এতো পপুলার, কেনো আমরা রিঅ্যাক্ট ইউজ করবো...।\n\nআমি খুব গভীরে গিয়ে টেকনিক্যাল কোনো ব্যাপার নিয়ে কথা বলবো না, বরং একদম সাধারণ ভাষায় বলবো আসলে রিঅ্যাক্ট কেনো স্পেশাল। টেকনিক্যাল ব্যাপারগুলো নিয়ে অন্য কোন সিরিজে বিস্তারিত বলবো, তবে আজকে সাধারণ নলেজ পর্যন্তই থাকুক।\n\nরিঅ্যাক্ট সাধারণত ইউজার ইন্টারফেস বানাতে ইউজ করা হয়। সহজেই ইউজার ইন্টারফেজ বানানো, পেজে যেকোনো ধরনের পরিবর্তন সহজেই, কম সময়ের মধ্যে করানো, ডাটা একজায়গা থেকে আরেকজায়গায় ফ্লো করানো, এগুলো সবকিছুতেই রিঅ্যাক্ট এক্সপার্ট। আর বিশেষ করে এ কারণেই রিঅ্যাক্ট এতো পপুলার। তাছাড়া আরো যে কারণ আছে সেগুলোর মধ্যে অন্যতম হলো রিঅ্যাক্ট এর অ্যাপিআই অনেক ছোটো। আর তাই শিখা যায় সহজে, আর কোড নিয়ে ডেভেলপারদের কনফিউশানে পড়তে হয় না। অন্যান্য কিছু লাইব্রেরীর মতো সিদ্ধান্তহীনতায় ভুগতে হয় না কোন টেকনিক ছেড়ে কোনটা ইউজ করবো এরকম ভাবনায়। তাছাড়া রিঅ্যাক্ট নেটিভ ইউজ করে নেটিভ অ্যান্ড্রয়েড, অ্যাপেলের ক্রস প্ল্যাটফর্ম অ্যাপ বানানো যায়। আরো যদি চান তাইলে সার্ভার সাইডেও নোড জেএস বা এরকম আরো যেগুলো আছে সেগুলোর সাথেও রিঅ্যাক্ট ইউজ করা যায় সহজে। তো এতো ছোটো একটা লাইব্রেরী হয়ে এতো কাজ একসাথে করতে পারলে রিঅ্যাক্ট পপুলার হবে না তো কে হবে?\n\nএখন তো গেলো সাধারন কারনগুলো। এবার আসি আরেকটু গভীরে যাই। আমরা সাধারণত ওয়েবসাইটে এইচটিএমএল, সিএসএস সহ জাভাস্ক্রিপ্ট ইউজ করি। এখন ব্রাউজার বিহ্যাইন্ড দ্যা সীনে একটা ডম ট্রি তৈরী করে যাতে ইউজার সেই ডমের সাথে ইন্টার‍্যাক্ট করতে পারে। ব্রাউজারের এই প্রসেসটাকে ক্রিটিক্যাল রেন্ডার পাথ[] বলে।\n\n"
      }    
]